### Feature Selection

In [29]:
import numpy as np
import pandas as pd

In [30]:
df= pd.read_csv(r"/teamspace/studios/this_studio/Data-Science---Practices/data/cleaned_house_prices.csv")

In [31]:
df.head()

,Index,Title,Description,Amount in rupees,Price (in rupees),location,Carpet Area in sqft,Status,Floor,Transaction,Furnishing,facing,overlooking,Bathroom,Balcony,Ownership
0,0,1 BHK Ready to Occupy Flat for sale in Srushti...,"Bhiwandi, Thane has an attractive 1 BHK Flat f...",4200000.0,6000.000000,thane,500.0,Ready to Move,10 out of 11,Resale,Unfurnished,Unknown,Unknown,1,2,Unknown
1,1,2 BHK Ready to Occupy Flat for sale in Dosti V...,One can find this stunning 2 BHK flat for sale...,9800000.0,13799.000000,thane,473.0,Ready to Move,3 out of 22,Resale,Semi-Furnished,East,Garden/Park,2,2,Freehold
2,2,2 BHK Ready to Occupy Flat for sale in Sunrise...,Up for immediate sale is a 2 BHK apartment in ...,14000000.0,17500.000000,thane,779.0,Ready to Move,10 out of 29,Resale,Unfurnished,East,Garden/Park,2,2,Freehold
3,3,1 BHK Ready to Occupy Flat for sale Kasheli,This beautiful 1 BHK Flat is available for sal...,2500000.0,7583.771885,thane,530.0,Ready to Move,1 out of 3,Resale,Unfurnished,Unknown,Unknown,1,1,Unknown
4,4,2 BHK Ready to Occupy Flat for sale in TenX Ha...,"This lovely 2 BHK Flat in Pokhran Road, Thane ...",16000000.0,18824.000000,thane,635.0,Ready to Move,20 out of 42,Resale,Unfurnished,West,"Garden/Park, Main Road",2,2,Co-operative Society

In [32]:
df.isna().sum()

Index                     0
Title                     0
Description               0
Amount in rupees       8579
Price (in rupees)         0
location                  0
Carpet Area in sqft       0
Status                    0
Floor                     0
Transaction               0
Furnishing                0
facing                    0
overlooking               0
Bathroom                  0
Balcony                   0
Ownership                 0
dtype: int64

In [33]:
df.drop(columns=['Title','Description','Status'],inplace=True)

### Label Encoding

In [34]:
from sklearn.preprocessing import LabelEncoder

# Function to perform Label Encoding for multiple columns
def label_encode_multiple(df, columns):
    le = LabelEncoder()
    for column in columns:
        df[column] = le.fit_transform(df[column])
    return df

label_encode_columns = ['location','Transaction','Floor', 'Furnishing', 'facing', 'overlooking', 'Ownership']
df = label_encode_multiple(df, label_encode_columns)

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 160959 entries, 0 to 160958
Data columns (total 13 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   Index                160959 non-null  int64
 1   Amount in rupees     152380 non-null  float64
 2   Price (in rupees)    160959 non-null  float64
 3   location             160959 non-null  int64
 4   Carpet Area in sqft  160959 non-null  float64
 5   Floor                160959 non-null  int64
 6   Transaction          160959 non-null  int64
 7   Furnishing           160959 non-null  int64
 8   facing               160959 non-null  int64
 9   overlooking          160959 non-null  int64
 10  Bathroom             160959 non-null  int64
 11  Balcony              160959 non-null  int64
 12  Ownership            160959 non-null  int64
dtypes: float64(3), int64(10)
memory usage: 16.0 MB

In [36]:
# Fill NaN values with the mean of the column
mean_value = df['Amount in rupees'].mean()
df['Amount in rupees'].fillna(mean_value, inplace=True)

/tmp/ipykernel_19817/2720252716.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Amount in rupees'].fillna(mean_value, inplace=True)

## Standared Scaling

In [37]:
from sklearn.preprocessing import StandardScaler
# Standardization
standard_scaler = StandardScaler()
df_standardized = standard_scaler.fit_transform(df)
df = pd.DataFrame(df_standardized, columns=df.columns)

In [38]:
df.head(4)

,Index,Amount in rupees,Price (in rupees),location,Carpet Area in sqft,Floor,Transaction,Furnishing,facing,overlooking,Bathroom,Balcony,Ownership
0,-1.732040,-0.602672,-0.153317,1.441223,-0.459231,-1.406322,0.547273,1.091819,1.076426,1.068635,-1.648374,0.028016,1.366291
1,-1.732019,-0.203648,0.487499,1.441223,-0.475347,0.385695,0.547273,-0.464253,-1.134456,-1.294568,-0.500893,0.028016,-0.726082
2,-1.731997,0.095621,0.791597,1.441223,-0.292700,-1.342449,0.547273,1.091819,-1.134456,-1.294568,-0.500893,0.028016,-0.726082
3,-1.731975,-0.723805,-0.023184,1.441223,-0.441324,-1.459551,0.547273,1.091819,1.076426,1.068635,-1.648374,-1.212210,1.366291

In [42]:
df.to_csv('/teamspace/studios/this_studio/Data-Science---Practices/data/final_dataset.csv', index=False)